{
  "id": "li_3a9d5d33d5",
  "title": "Coordenação de Branding",
  "company": "VOLL",
  "location": "São Paulo, São Paulo, Brazil",
  "url": "https://br.linkedin.com/jobs/view/coordena%C3%A7%C3%A3o-de-branding-at-voll-4356577847",
  "description": "A VOLL nasceu para simplificar a mobilidade com uma solução única e global. É a tecnologia mais usada pelas maiores empresas do Brasil para gerir o deslocamento e as viagens das suas equipes.\nQue tal fazer parte disso tudo?\nBuscamos uma pessoa para atuar na\nCoordenação de Branding\n, onde irá liderar e integrar todas as frentes que constroem a percepção da VOLL no mercado, da identidade visual à narrativa, do conteúdo ao audiovisual, do\nproduct marketing\nà geração de demanda via comunicação.\nEssa posição conecta marca, produto, performance e experiência do cliente. Você será responsável por garantir que tudo o que a VOLL comunica pro mercado esteja alinhado à nossa proposta de valor, gere impacto real no funil e aproxime cada vez mais o produto do mercado.\nResponsabilidades e atribuições\nO que você irá fazer:\nBranding, Design & Identidade\nSer responsável por toda a estratégia de marca da VOLL, garantindo consistência visual e narrativa em todos os pontos de contato.\nLiderar a frente de Design e Marca, assegurando qualidade, evolução do design system e alinhamento com posicionamento estratégico.\nGarantir que campanhas, materiais e peças traduzam claramente os diferenciais da VOLL (tecnologia, IA e experiência).\nConteúdo & Comunicação\nCoordenar a estratégia de conteúdo institucional e de marca: redes sociais, comunicação com clientes, newsletters, PR e narrativas institucionais.\nGarantir consistência de tom de voz, mensagens-chave e storytelling da VOLL em todos os canais.\nAtuar junto à agência de PR para ampliar visibilidade, autoridade e presença da marca na imprensa.\nLiderar a frente de Product Marketing, conectando produto, tecnologia e mercado — transformando funcionalidades em benefícios claros e desejáveis.\nAudiovisual\nCoordenar a frente de audiovisual (videomaker), garantindo produção de vídeos institucionais, campanhas, produtos, eventos e conteúdos de marca.\nDefinir conceitos criativos, roteiros e formatos alinhados à estratégia de branding e crescimento.\nEmail Marketing & Geração de Demanda\nLiderar a estratégia de e-mail marketing da VOLL para clientes, leads, prospects e oportunidades perdidas.\nConstruir narrativas de e-mail que gerem relacionamento, autoridade e demanda qualificada.\nTrabalhar em conjunto com Performance para garantir que branding e geração de leads caminhem juntos.\n﻿\nGestão, Integração & Estratégia\nCoordenar pessoas, freelancers e parceiros envolvidos nas frentes de branding.\nAtuar como elo entre Branding, Performance, Produto, Vendas e CS.\nPlanejar calendários, campanhas e entregas estratégicas com visão de curto, médio e longo prazo.\nAcompanhar indicadores de marca, engajamento, performance e geração de demanda.\nRequisitos e qualificações\nRequisitos básicos:\nFormação em Marketing, Comunicação, Publicidade, Jornalismo ou áreas correlatas.\nExperiência prévia em posições de liderança ou coordenação de branding, comunicação ou marketing.\nVivência em empresas de tecnologia, startups ou ambientes de crescimento acelerado.\nF",
  "scraped_at": "2026-01-30T11:50:48.670153"
}