{
  "id": "li_5789f8206e",
  "title": "Estágio em Cultura & Treinamento - São Paulo",
  "company": "Amcham-Brasil",
  "location": "São Paulo, São Paulo, Brazil",
  "url": "https://br.linkedin.com/jobs/view/est%C3%A1gio-em-cultura-treinamento-s%C3%A3o-paulo-at-amcham-brasil-4356597684",
  "description": "Estamos em busca de uma pessoa estagiária para atuar na área de Recursos Humanos da Amcham Brasil, apoiando as frentes de Cultura, Bem-estar e Treinamento & Desenvolvimento (T&D). Nosso time é responsável por fortalecer os valores da organização, o clima organizacional e o desenvolvimento contínuo das pessoas, por meio de iniciativas que promovem aprendizado, engajamento e qualidade de vida no trabalho.\nTrabalhamos para criar rituais, ações e experiências que estimulam o crescimento profissional e contribuem para um ambiente leve, colaborativo e em constante evolução.\nAqui, você vai encontrar um espaço dinâmico e colaborativo, terá contato direto com ações estratégicas das áreas de Cultura e T&D, mas atuará principalmente na sustentação operacional que garante a qualidade das entregas, o bom funcionamento das iniciativas e a experiência positiva dos participantes.\nSe você quer aprender sobre cultura organizacional, clima, experiência do colaborador e desenvolvimento de pessoas, trabalhando em um ambiente que valoriza o protagonismo, a troca e as boas ideias, a Amcham Brasil pode ser o seu lugar!\nResponsabilidades e atribuições\nDar suporte na organização e execução de ações de cultura e bem-estar e treinamento e desenvolvimento, cuidando de rotinas e entregas operacionais;\nAuxiliar na logística de campanhas internas, datas comemorativas, eventos corporativos, ações de saúde mental, treinamentos e programas de reconhecimento;\nApoiar a comunicação interna, revisando textos, organizando informações e contribuindo na criação de conteúdos simples para nossos canais internos;\nContribuir com pesquisas de clima e engajamento, apoiando tabulação de dados, organização de planilhas e preparação de materiais;\nApoiar o acompanhamento de turmas de treinamentos e ações de desenvolvimento, em parceria com consultores internos e/ou externos, contribuindo na organização, controle de participantes e apoio operacional das atividades;\nAjudar o time de RH na execução de iniciativas de experiência do colaborador, como onboarding, celebrações e ações de integração;\nColaborar na atualização e controle de indicadores da área, mantendo planilhas organizadas e acompanhando resultados;\nPesquisar referências e tendências sobre cultura, diversidade, bem-estar e employee experience, apoiando a evolução contínua das iniciativas.\nRequisitos e qualificações\nEnsino superior cursando em Administração, Comunicação Social, Relações Públicas, Psicologia ou Gestão de Recursos Humanos ou áreas correlatas;\nConhecimento básico em Pacote Office (principalmente PowerPoint e Excel);\nBoa comunicação escrita e verbal;\nDisponibilidade para atuar em modelo híbrido, sendo 3x na semana presencial.\nÉ MUITO IMPORTANTE QUE VOCÊ:\nSeja uma pessoa curiosa, organizada e com vontade genuína de aprender sobre cultura organizacional, engajamento e experiência do colaborador.\nGoste de trabalhar com pessoas;\nTenha atenção aos detalhes e responsabilidade com prazos;\nSe comunique bem e sabe pedir ajuda quando nec",
  "scraped_at": "2026-01-30T11:50:23.756759"
}