{
  "id": "li_5a0c6fb969",
  "title": "Marketing & Communications Manager, LatAm",
  "company": "ICEYE",
  "location": "Brazil",
  "url": "https://br.linkedin.com/jobs/view/marketing-communications-manager-latam-at-iceye-4367463249",
  "description": "Role Highlights:\nTitle: Marketing & Communications Manager, LatAm\nDepartment: Data & Missions Marketing\nLocation: Brazil\nReporting to: Director, Data & Missions Marketing\nPermanent\nEmployment is subject to applicable security screening (incl. SUPO)\nWho are we?\nICEYE delivers unparalleled persistent monitoring capabilities to detect and respond to changes in any location on Earth, faster and more accurately than ever before.\nOwning the world's largest synthetic aperture radar (SAR) satellite constellation, ICEYE provides objective, near real-time insights, ensuring that customers have unmatched access to actionable data, day or night, even in challenging environmental conditions. As a trusted partner to governments and commercial industries, ICEYE delivers intelligence in sectors such as defense and intelligence, insurance, natural catastrophe response and recovery, security, maritime monitoring, and finance.\nICEYE is headquartered in Finland and operates internationally with offices in Poland, Spain, the UK, Australia, Japan, UAE, Greece, and the US. We have more than 900 employees from nearly 60 countries, inspired by the shared vision of improving life on Earth by becoming the global source of truth in Earth Observation.\nWhy should you work for us?\nICEYE is at the cutting edge of space-based intelligence technology. We design, build, and operate the world's largest SAR satellite constellation, and we are delivering sovereign ISR capabilities to governments across Europe and beyond.\nWorking with ICEYE, you will be part of making the impossible possible while shaping the defense technology industry. You will work with diverse and engaged colleagues to further the ICEYE mission. At ICEYE, we know that without great people we cannot succeed. You will be an integral, valued, and appreciated colleague with the ability to directly shape the vision and direction of the business.\nWe actively support continuous professional development and provide access to courses, training, and conferences. ICEYE is a place where your development, growth, and success is a priority.\nThe Mission of the Marketing & Communications Manager, LatAm\nAccelerate Missions pipeline growth and brand leadership in Latin America by developing and executing localized marketing campaigns, strategic communications, and sales enablement that position ICEYE as the sovereign ISR partner of choice for Latin American defense decision-makers.\nThe Role\nThe ICEYE Data and Missions Marketing team is growing and looking for an experienced Missions Marketing Manager for Latin America to join as soon as possible.\nIn this role, you will lead and implement all marketing and communications plans and activities in Latin America for the Satellite Missions line of business. This includes:\nPlanning, developing, and executing high-impact marketing campaigns aligned with sales priorities and commercial objectives\nDriving measurable ROI across multiple channels: PR, events, digital, social media, and thought",
  "scraped_at": "2026-01-30T11:50:43.173438"
}