{
  "id": "li_9e55965cf6",
  "title": "Assistente Atendimento I",
  "company": "Interplayers",
  "location": "São Paulo, São Paulo, Brazil",
  "url": "https://br.linkedin.com/jobs/view/assistente-atendimento-i-at-interplayers-4367327635",
  "description": "DESCRIÇÃO\nResponsabilidades\nAtender e solucionar questões de clientes, oferecendo suporte especializado em produtos, serviços ou processos;\nRealizar diagnósticos detalhados sobre problemas mais complexos e fornecer soluções adequadas, quando necessário;\nEncaminhar casos mais complexos para as áreas apropriadas, seguindo os procedimentos e protocolos da empresa;\nAcompanhar o andamento de solicitações, garantindo o cumprimento de prazos e qualidade no atendimento;\nFornecer orientações técnicas ou operacionais a clientes, esclarecendo dúvidas e informações sobre serviços/produtos;\nAtualizar registros e históricos dos atendimentos no sistema de forma precisa e detalhada;\nManter-se atualizado sobre as mudanças nos produtos, serviços e processos internos da empresa;\nPrestar suporte a outros membros da equipe, quando necessário, compartilhando conhecimentos especializados;\nContribuir para a implementação de melhorias nos processos de atendimento, identificando oportunidades de otimização;\nIdentificação e reporte de casos de Reclamação técnica e Farmacovigilância à Industria.\nRequisitos\nEstar cursando ou ser formado em cursos da área da saúde (Enfermagem, Farmácia, Nutrição, Biomedicina, Fisioterapia).\nExperiência anterior em atendimento ao cliente, preferencialmente em áreas que envolvem um atendimento especializado e humanizado;\nHabilidade para lidar com situações complexas, mantendo a calma e objetividade;\nBoa comunicação verbal e escrita;\nProatividade e capacidade de resolução de problemas;\nFamiliaridade com sistemas de atendimento e ferramentas de CRM.\nHabilidades e Competências\nHabilidade em resolver problemas de forma eficaz e eficiente;\nEmpatia e paciência para lidar com situações delicadas ou que envolvem insatisfação do cliente;\nComprometimento com a qualidade no atendimento e experiência do cliente;\nOrganização e atenção aos detalhes.\nExperiência prévia em farmacovigilância será um diferencial.\nLocal de trabalho: São Paulo, SP\nRegime de contratação de tipo: Efetivo – CLT\nJornada: Período Integral\nÁrea e especialização profissional: Saúde - Farmácia\nNível hierárquico: Assistente\nREQUISITOS\nEscolaridade Mínima: Ensino Superior\nBENEFÍCIOS\nparceria com instituições de ensino e escolas de idiomas;\nHealthy (Programa de Benefício em Medicamentos)\nPPR (Programa de Participação nos Resultados)\nGympass, Total Pass Dia de recarregar (Day off aniversário);\nPetLove -\nCartão Swile, com mais liberdade para usar seus benefícios (Refeição/Alimentação), R$ 41,00 por dia)\nVale Transporte ou estacionamento;\nAssistência Odontológica;\nAssistência Médica\nSeguro de Vida;\nAuxílio Creche;",
  "scraped_at": "2026-01-30T11:50:21.166910"
}