{
  "id": "li_f14e929feb",
  "title": "Brand Partnerships Manager (BPM) - Beauty - Global Business Solutions - São Paulo",
  "company": "TikTok",
  "location": "São Paulo, São Paulo, Brazil",
  "url": "https://br.linkedin.com/jobs/view/brand-partnerships-manager-bpm-beauty-global-business-solutions-s%C3%A3o-paulo-at-tiktok-4366871565",
  "description": "Responsibilities\nTeam Introduction\nOur team is dedicated to fostering and expanding relationships with our clients. We are committed to delivering exceptional client service and comprehensive education on our products and solutions. Our aim is to empower our clients to meet and exceed their business objectives.\nAbout the Role\nThe Brand Partnerships Manager (BPM) is responsible for hitting revenue goals, building relationships with key enterprise accounts and helping clients drive business results on TikTok through product consultation, education, and support. Success as a BPM requires strong strategic vision, sales skills, strong partnership with Client Solutions Manager (CSM), problem-solving skills, attention to detail, and the ability to thrive in a dynamic and changing environment.\nResponsibilities\n- Lead C Suite level conversations to increase revenue and grow strategic partnerships;\n- Demonstrate in-depth insights of the sales process and product combination;\n- Lead account planning process that aligns brand and TikTok resources to maximize opportunities;\n- Grow revenue, educate and lead strategic conversations with clients and navigate complex relationships;\n- Demonstrate expertise in all matters relevant to your book of business, including escalation and troubleshooting to resolve client issues;\n- Spearhead client education on products and give product updates to advise on the best approach to drive business outcomes for clients and agencies;\n- Lead collaboration with external clients and internal stakeholders.\nQualifications\nMinimum Qualifications\n- 5+ years of media sales, digital marketing, brand advertising, and/or online advertising experience;\n- Track record of building compelling presentations leveraging industry and internal proof points;\n- Knowledge of the self-serve platform, auction, and biddable form of digital advertising buying.\nPreferred Qualifications\n- Proven ability to establish strategic relationships with advertisers, agency and C-level relationships;\n- Track record of delivering and exceeding revenue goals;\n- Creative, outside-the-box thinker and strategist;\n- A team player and collaborator.\nAbout ByteDance Brazil\nByteDance is a global incubator of platforms at the cutting edge of commerce, content, entertainment, and enterprise services - over 2.5 billion people interact with ByteDance products, including TikTok.​\nWhy Join Us\nInspiring creativity is at the core of TikTok's mission. Our innovative product is built to help people authentically express themselves, discover and connect – and our global, diverse teams make that possible. Together, we create value for our communities, inspire creativity and bring joy - a mission we work towards every day.​\nWe strive to do great things with great people. We lead with curiosity, humility, and a desire to make impact in a rapidly growing tech company. Every challenge is an opportunity to learn and innovate as one team. We're resilient and embrace challenges as they come. By c",
  "scraped_at": "2026-01-30T11:50:47.230109"
}