{
  "id": "linkedin_16a4fcf501f8",
  "title": "Lead Product Owner - Digital Asset Management",
  "company": "Kimberly-Clark",
  "location": "São Paulo, São Paulo, Brazil",
  "description": "**Job Description**\n* please send cv in English\\*\n\n\n**Your Job**\n You’re not the person who will settle for just any role. Neither are we. Because we’re out to create Better Care for a Better World, and that takes a certain kind of person and teams who care about making a difference. Here, you’ll bring your professional expertise, talent, and drive to building and managing our portfolio of iconic, ground\\-breaking brands. In this role, you’ll help us deliver better care for billions of people around the world. It starts with YOU.\n   \n\n  \n\n The Product Owner is responsible for maximizing product value by clearly articulating vision and prioritizing the product features for a cross\\-functional delivery team to develop. The Product Owner ensures the right product features are built by the product team in the most efficient manner. They work in an open, collaborative, and approachable manner with the product, engineering, and business teams to inspire optimal solutions that solve customers’ problems and challenge the team to find the smartest, most efficient solutions.\n   \n\n  \n\n This role reports to a Product Manager aligned to a platform at a global or regional level and is an equal partner with the Platform Solution Manager or architect on the product roadmap and prioritization. The product owner will participate in the planning and management of related budgets. The product owner will lead the build, change, and run tasks, monitor application performance, and understand real\\-user behavior and needs balanced with business objectives to prioritize the road map. Scope may span brands, or sectors, business operations, or product features and capabilities.\n   \n\n  \n\n The Product Owner will work on a global platform that has reached all Business Units, Geographic Regions and/or Segments. The product owner will understand consumer and business objectives, goals, and requirements to write user stories and acceptance criteria, prioritize the backlog, create documentation, drive demand into other teams as necessary, and establish a reliable predictable cadence of releases to production.\n   \n\n  \n\n The product owner must understand and lead complex technical solutions, including privacy by design, security by design, and meet and maintain regulatory compliance per company standards.\n   \n\n  \n\n**In This Role, You Will**\n* Work closely with the respective Product Manager(s), Platform Solution Manager(s), and Architect(s) to define product features according to product vision, roadmap, strategy and adoption.\n* Works in close collaboration with stakeholders from cross functional teams and Business Units to understand their expectations and helps the team understand how to be set up for successful user acceptance testing\n* Identify new AI opportunities and capabilities that drive value for the business.\n* Prioritize and lead the implementation and adoption by users of new AI capabilities in the platform.\n* Work with other product teams to prioritize the demand you may inject in to their backlog and are dependent upon to deliver on your backlog.\n* Actively plans and prioritizes the product feature backlog according to business value and clearly articulates priorities for the product team. Working with the Platform Solution Manager balances the need to address technical debt and supports technical innovation in addition to adding product features\n* Leads the planning of product releases and sets expectations for delivery of new features with stakeholders. Collaborates with stakeholders regarding the correction of defects.\n* Writes detailed user stories and acceptance criteria at a pace to ensure the product team always has an adequate number of prepared stories to work on. Works closely with the Platform Solution Manager and team to ensure stories in the upcoming sprint are fully understood and stories in future sprints are well groomed \\& estimated.\n* Sets sprint goals in coordination with the product team and drives the team to deliver promised value. Ensures the volume and sequence of work flowing to the product team optimizes team performance and maximizes the value delivered.\n* Actively participates in Agile ceremonies to provide immediate answers and direction to the product team based on domain expertise.\n* Always represents the voice of the consumer within the team.\n* Facilitates sprint planning and backlog refinement and/or coordinates the scrum ceremonies across the product team.\n* Creates a sense of common goal for the entire team based on the product vision.\n* Ensures the entire team understands items in the product backlog to the level needed for them to estimate and commit to work during sprint planning.\n* Includes the entire team in the discovery backlog and regular design exercises.\n* Strong communicator that can drive productive dialogue with critical stakeholders and can translate complex business requirements into technical solutions.\n* Coordinates the sprint review with relevant stakeholders, faithfully communicates in the language of the business, and writes new user stories as needed based on customer feedback.\n* Works in close cooperation with the team during retrospectives, with a view to identifying continuous improvement opportunities.\n* Coordinates with multiple parties (Product team, Vendors, Strategic Partners, Platform Solution Manager, business partners, etc.) to meet the customer’s priorities while being aware of the insights, needs and constraints of those stakeholders.\n* Has the ability to communicate realistic expectations to business stakeholders and is able to push back in a professional manner on requests that cannot be met from a fixed capacity team when appropriate\n* Provides performance feedback to product team members’ administrative leaders.\n* Collaborates with other Product Owners as needed to align on release plans and ensure backlogs are in alignment with the overall organizational strategy.\n* Owns the outward communication of product progress and value to stakeholders.\n* Maintains technical competency in Digital Asset Management (DAM) platforms on which the product is built.\n\n\n**About Us**\n Huggies®. Kleenex®. Cottonelle®. Scott®. Kotex®. Poise®. Depend®. Kimberly\\-Clark Professional®. You already know our legendary brands—and so does the rest of the world. In fact, millions of people use Kimberly\\-Clark products every day. We know these amazing Kimberly\\-Clark products wouldn’t exist without talented professionals, like you.\n   \n\n  \n\n At Kimberly\\-Clark, you’ll be part of the best team committed to driving innovation, growth and impact. We’re founded on more than 150 years of market leadership, and we’re always looking for new and better ways to perform – so there’s your open door of opportunity. It’s all here for you at Kimberly\\-Clark.\n   \n\n  \n\n**About You**\n You perform at the highest level possible, and you appreciate a performance culture fueled by authentic caring. You want to be part of a company actively dedicated to sustainability, inclusion, wellbeing, and career development.\n   \n\n  \n\n You love what you do, especially when the work you do makes a difference. At Kimberly\\-Clark, we’re constantly exploring new ideas on how, when, and where we can best achieve results. When you join our team, you’ll experience Flex\n   \n\n  \n\n That Works: flexible work arrangements that empower you to have purposeful time in the office and partner with your leader to make flexibility work for both you and the business.\n   \n\n  \n\n**Qualifications**\n In one of our professional roles, you’ll focus on winning with consumers and the market, while putting safety, mutual respect, and human dignity at the center. To succeed in this role, you will need the following qualifications:\n   \n\n  \n\n**Who you are?**\n* B.S. degree or equivalent\n* 5\\-7 years of experience in Digital Asset Management (DAM) and/or integrated marketing programs across multiple platforms, specializing in digital consumer experiences.\n* Deep understanding and broad experience with multiple functional areas such as DAM, e\\-commerce, web experience management, CMS etc. and practical experience with integrated execution.\n* Domain knowledge around the product that will be owned utilizing technologies, such as Aprimo (preferred) or similar.\n* Demonstrable ability to translate business needs into requirements and define those in a written format that allows the development teams to align behind the product vision.\n* Outstanding organizational, communication, relationship\\-building, and collaboration skills at all levels.\n* Sharp analytical and problem\\-solving skills.\n* Experience as a change agent at multiple levels of an organization.\n* Certified Scrum Product Owner or similar is a plus.\n\n\n**To Be Considered**\n Click the Apply button and complete the online application process. A member of our recruiting team will review your application and follow up if you seem like a great fit for this role.\n   \n\n  \n\n In the meantime, please check out the careers website.\n   \n\n  \n\n And finally, the fine print….\n   \n\n  \n\n*For Kimberly\\-Clark to grow and prosper, we must be an inclusive organization that applies the diverse experiences and passions of its team members to brands that make life better for people all around the world. We actively seek to build a workforce that reflects the experiences of our consumers. When you bring your original thinking to Kimberly\\-Clark, you fuel the continued success of our enterprise. We are a committed equal opportunity employer, and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, sexual orientation, gender identity, age, pregnancy, genetic information, citizenship status, or any other characteristic protected by law.*\n*The statements above are intended to describe the general nature and level of work performed by employees assigned to this classification. Statements are not intended to be construed as an exhaustive list of all duties, responsibilities and skills required for this position.*\n*Employment is subject to verification of pre\\-screening tests, which may include drug screening, background check, and DMV check.*\n**Primary Location**\n Sao Paulo Office\n   \n\n  \n\n**Additional Locations**\n Buenos Aires \\- Olivos Office\n   \n\n  \n\n**Worker Type**\n Employee\n   \n\n  \n\n**Worker Sub\\-Type**\n Regular\n   \n\n  \n\n**Time Type**\n Full time",
  "url": "https://www.linkedin.com/jobs/view/4355980498",
  "source": "linkedin",
  "scraped_at": "2026-02-02T16:50:32.838837",
  "logo_url": NaN,
  "salary_info": null,
  "applied": false,
  "resume_generated": false,
  "keywords": [
    "experiences",
    "per",
    "management",
    "communication",
    "consumers",
    "engineering",
    "operations",
    "agent",
    "life",
    "years",
    "experience",
    "roadmap",
    "level",
    "consumer",
    "commerce",
    "open",
    "customer",
    "format",
    "stakeholders",
    "makes",
    "customers",
    "digital",
    "demand",
    "national",
    "improvement",
    "lead",
    "list",
    "impact",
    "set",
    "product owner",
    "full",
    "performance",
    "perform",
    "functional",
    "sustainability",
    "maintain",
    "growth",
    "grow",
    "thinking",
    "employee",
    "map",
    "process",
    "ai",
    "age",
    "strategic",
    "expertise",
    "brands",
    "detailed",
    "partners",
    "success",
    "constraints",
    "leadership",
    "maintains",
    "enterprise",
    "domain",
    "production",
    "design",
    "manager",
    "strategy",
    "product manager",
    "leads",
    "cross",
    "testing",
    "marketing",
    "product",
    "road",
    "certain",
    "make",
    "partner",
    "leader",
    "change",
    "architect",
    "implementation",
    "across",
    "aires",
    "productive",
    "english",
    "drive",
    "successful",
    "met",
    "planning",
    "business",
    "able",
    "position",
    "faithfully",
    "leaders",
    "market",
    "products",
    "part",
    "goals",
    "span",
    "platforms",
    "without",
    "here",
    "empower",
    "releases",
    "locations",
    "results",
    "reports",
    "regular",
    "understand",
    "demonstrable",
    "articulating",
    "website",
    "balanced",
    "sequence",
    "around",
    "appropriate",
    "founded",
    "collaborative",
    "practical",
    "levels",
    "discovery",
    "neither",
    "description",
    "poise",
    "always",
    "writes",
    "alignment",
    "relevant",
    "construed",
    "assigned",
    "behavior",
    "vision",
    "direction",
    "solution",
    "cannot",
    "appreciate",
    "view",
    "features",
    "capacity",
    "answers",
    "execution",
    "according",
    "wouldn",
    "review",
    "race",
    "defects",
    "button",
    "worker",
    "fact",
    "verification",
    "build",
    "items",
    "legendary",
    "create",
    "dependent",
    "closely",
    "immediate",
    "dam",
    "organization",
    "qualified",
    "because",
    "recruiting",
    "requests",
    "users",
    "administrative",
    "fueled",
    "making",
    "technologies",
    "needs",
    "solutions",
    "online",
    "continuous",
    "user",
    "regional",
    "sexual",
    "application",
    "know",
    "competency",
    "continued",
    "members",
    "working",
    "allows",
    "aware",
    "release",
    "equivalent",
    "respect",
    "upcoming",
    "color",
    "delivered",
    "inspire",
    "highest",
    "sao",
    "into",
    "platform",
    "nature",
    "including",
    "feature",
    "authentic",
    "sets",
    "sex",
    "asset",
    "passions",
    "agile",
    "right",
    "groomed",
    "want",
    "opportunity",
    "solve",
    "flexibility",
    "priorities",
    "includes",
    "receive",
    "segments",
    "paulo",
    "religion",
    "etc",
    "genetic",
    "help",
    "adoption",
    "backlogs",
    "describe",
    "talent",
    "ensures",
    "deliver",
    "looking",
    "duties",
    "breaking",
    "scrum",
    "value",
    "necessary",
    "ability",
    "professionals",
    "identity",
    "career",
    "focus",
    "ground",
    "inclusive",
    "depend",
    "office",
    "reached",
    "takes",
    "insights",
    "feedback",
    "care",
    "acceptance",
    "classification",
    "ways",
    "reflects",
    "tests",
    "required",
    "coordinates",
    "identifying",
    "cooperation",
    "common",
    "there",
    "critical",
    "like",
    "deep",
    "gender",
    "coordination",
    "commit",
    "problem",
    "regard",
    "geographic",
    "regarding",
    "dedicated",
    "achieve",
    "role",
    "programs",
    "veteran",
    "pace",
    "preferred",
    "retrospectives",
    "check",
    "optimizes",
    "origin",
    "huggies",
    "possible",
    "building",
    "articulates",
    "human",
    "objectives",
    "define",
    "clark",
    "plus",
    "meet",
    "sprints",
    "cms",
    "debt",
    "professional",
    "works",
    "performed",
    "vendors",
    "inject",
    "succeed",
    "job",
    "criteria",
    "align",
    "realistic",
    "inclusion",
    "about",
    "integrated",
    "olivos",
    "real",
    "fully",
    "find",
    "seem",
    "seek",
    "reliable",
    "wellbeing",
    "iconic",
    "background",
    "optimal",
    "prosper",
    "intended",
    "constantly",
    "identify",
    "safety",
    "voice",
    "statements",
    "include",
    "kimberly",
    "company",
    "security",
    "cottonelle",
    "kind",
    "within",
    "future",
    "aligned",
    "capabilities",
    "addition",
    "flowing",
    "kleenex",
    "progress",
    "global",
    "opportunities",
    "diverse",
    "delivery",
    "backlog",
    "predictable",
    "complete",
    "written",
    "certified",
    "respective",
    "areas",
    "knowledge",
    "analytical",
    "disability",
    "starts",
    "characteristic",
    "best",
    "day",
    "stories",
    "workforce",
    "prioritizing",
    "exhaustive",
    "center",
    "participates",
    "flex",
    "communicate",
    "prioritize",
    "parties",
    "requirements",
    "while",
    "development",
    "one",
    "well",
    "units",
    "member",
    "primary",
    "establish",
    "use",
    "degree",
    "general",
    "promised",
    "collaborates",
    "manner",
    "teams",
    "challenge",
    "being",
    "please",
    "write",
    "during",
    "sense",
    "participate",
    "time",
    "aprimo",
    "considered",
    "meantime",
    "kotex",
    "screening",
    "team",
    "exist",
    "sprint",
    "dignity",
    "skills",
    "original",
    "utilizing",
    "especially",
    "built",
    "great",
    "language",
    "exploring",
    "qualifications",
    "correction",
    "monitor",
    "helps",
    "buenos",
    "better",
    "culture",
    "estimate",
    "clearly",
    "behind",
    "billions",
    "b.s",
    "strong",
    "multiple",
    "documentation",
    "flexible",
    "driving",
    "any",
    "winning",
    "estimated",
    "understanding",
    "approachable",
    "cadence",
    "outward",
    "scope",
    "employer",
    "creates",
    "facilitates",
    "fine",
    "mutual",
    "pre",
    "type",
    "roles",
    "follow",
    "adequate",
    "law",
    "owners",
    "technical",
    "provide",
    "putting",
    "communicator",
    "world",
    "plans",
    "location",
    "collaboration",
    "sub",
    "fuel",
    "consideration",
    "amazing",
    "new",
    "maximizes",
    "compliance",
    "budgets",
    "address",
    "drives",
    "adding",
    "number",
    "owned",
    "status",
    "sharp",
    "broad",
    "smartest",
    "problems",
    "understands",
    "solving",
    "click",
    "love",
    "committed",
    "understood",
    "dmv",
    "based",
    "out",
    "balances",
    "above",
    "regions",
    "difference",
    "represents",
    "sectors",
    "specializing",
    "pregnancy",
    "finally",
    "goal",
    "provides",
    "already",
    "entire",
    "owns",
    "expectations",
    "applicants",
    "scott",
    "communicates",
    "caring",
    "web",
    "citizenship",
    "translate",
    "run",
    "settle",
    "fit",
    "orientation",
    "person",
    "responsibilities",
    "responsible",
    "than",
    "careers",
    "ceremonies",
    "drug",
    "supports",
    "employees",
    "tasks",
    "privacy",
    "upon",
    "efficient",
    "maximizing",
    "outstanding",
    "rest",
    "back",
    "millions",
    "complex",
    "organizational",
    "protected",
    "refinement",
    "exercises",
    "similar",
    "equal",
    "regulatory",
    "dialogue",
    "actively",
    "relationship",
    "door",
    "following",
    "people",
    "send",
    "owner",
    "develop",
    "prepared",
    "talented",
    "fixed",
    "volume",
    "join",
    "print",
    "prioritizes",
    "additional",
    "purposeful",
    "applies",
    "ensure",
    "work",
    "needed",
    "standards",
    "overall",
    "bring",
    "arrangements",
    "managing",
    "apply",
    "need",
    "close",
    "information",
    "innovation",
    "related",
    "subject",
    "just",
    "push",
    "employment",
    "ideas",
    "portfolio",
    "prioritization"
  ],
  "match_score": 1.0,
  "matched_keywords": [
    "experiences",
    "per",
    "management",
    "communication",
    "consumers",
    "engineering",
    "operations",
    "agent",
    "life",
    "years",
    "experience",
    "roadmap",
    "level",
    "consumer",
    "commerce",
    "open",
    "customer",
    "format",
    "stakeholders",
    "makes",
    "customers",
    "digital",
    "demand",
    "national",
    "improvement",
    "lead",
    "list",
    "impact",
    "set",
    "product owner",
    "full",
    "performance",
    "perform",
    "functional",
    "sustainability",
    "maintain",
    "growth",
    "grow",
    "thinking",
    "employee",
    "map",
    "process",
    "ai",
    "age",
    "strategic",
    "expertise",
    "brands",
    "detailed",
    "partners",
    "success",
    "constraints",
    "leadership",
    "maintains",
    "enterprise",
    "domain",
    "production",
    "design",
    "manager",
    "strategy",
    "product manager",
    "leads",
    "cross",
    "testing",
    "marketing",
    "product",
    "road",
    "certain",
    "make",
    "partner",
    "leader",
    "change",
    "architect",
    "implementation",
    "across",
    "aires",
    "productive",
    "english",
    "drive",
    "successful",
    "met",
    "planning",
    "business",
    "able",
    "position",
    "faithfully",
    "leaders",
    "market",
    "products",
    "part"
  ],
  "missing_keywords": [
    "goals",
    "span",
    "platforms",
    "without",
    "here",
    "empower",
    "releases",
    "locations",
    "results",
    "reports",
    "regular",
    "understand",
    "demonstrable",
    "articulating",
    "website",
    "balanced",
    "sequence",
    "around",
    "appropriate",
    "founded",
    "collaborative",
    "practical",
    "levels",
    "discovery",
    "neither",
    "description",
    "poise",
    "always",
    "writes",
    "alignment",
    "relevant",
    "construed",
    "assigned",
    "behavior",
    "vision",
    "direction",
    "solution",
    "cannot",
    "appreciate",
    "view",
    "features",
    "capacity",
    "answers",
    "execution",
    "according",
    "wouldn",
    "review",
    "race",
    "defects",
    "button",
    "worker",
    "fact",
    "verification",
    "build",
    "items",
    "legendary",
    "create",
    "dependent",
    "closely",
    "immediate",
    "dam",
    "organization",
    "qualified",
    "because",
    "recruiting",
    "requests",
    "users",
    "administrative",
    "fueled",
    "making",
    "technologies",
    "needs",
    "solutions",
    "online",
    "continuous",
    "user",
    "regional",
    "sexual",
    "application",
    "know",
    "competency",
    "continued",
    "members",
    "working",
    "allows",
    "aware",
    "release",
    "equivalent",
    "respect",
    "upcoming",
    "color",
    "delivered",
    "inspire",
    "highest",
    "sao",
    "into",
    "platform",
    "nature",
    "including",
    "feature",
    "authentic",
    "sets",
    "sex",
    "asset",
    "passions",
    "agile",
    "right",
    "groomed",
    "want",
    "opportunity",
    "solve",
    "flexibility",
    "priorities",
    "includes",
    "receive",
    "segments",
    "paulo",
    "religion",
    "etc",
    "genetic",
    "help",
    "adoption",
    "backlogs",
    "describe",
    "talent",
    "ensures",
    "deliver",
    "looking",
    "duties",
    "breaking",
    "scrum",
    "value",
    "necessary",
    "ability",
    "professionals",
    "identity",
    "career",
    "focus",
    "ground",
    "inclusive",
    "depend",
    "office",
    "reached",
    "takes",
    "insights",
    "feedback",
    "care",
    "acceptance",
    "classification",
    "ways",
    "reflects",
    "tests",
    "required",
    "coordinates",
    "identifying",
    "cooperation",
    "common",
    "there",
    "critical",
    "like",
    "deep",
    "gender",
    "coordination",
    "commit",
    "problem",
    "regard",
    "geographic",
    "regarding",
    "dedicated",
    "achieve",
    "role",
    "programs",
    "veteran",
    "pace",
    "preferred",
    "retrospectives",
    "check",
    "optimizes",
    "origin",
    "huggies",
    "possible",
    "building",
    "articulates",
    "human",
    "objectives",
    "define",
    "clark",
    "plus",
    "meet",
    "sprints",
    "cms",
    "debt",
    "professional",
    "works",
    "performed",
    "vendors",
    "inject",
    "succeed",
    "job",
    "criteria",
    "align",
    "realistic",
    "inclusion",
    "about",
    "integrated",
    "olivos",
    "real",
    "fully",
    "find",
    "seem",
    "seek",
    "reliable",
    "wellbeing",
    "iconic",
    "background",
    "optimal",
    "prosper",
    "intended",
    "constantly",
    "identify",
    "safety",
    "voice",
    "statements",
    "include",
    "kimberly",
    "company",
    "security",
    "cottonelle",
    "kind",
    "within",
    "future",
    "aligned",
    "capabilities",
    "addition",
    "flowing",
    "kleenex",
    "progress",
    "global",
    "opportunities",
    "diverse",
    "delivery",
    "backlog",
    "predictable",
    "complete",
    "written",
    "certified",
    "respective",
    "areas",
    "knowledge",
    "analytical",
    "disability",
    "starts",
    "characteristic",
    "best",
    "day",
    "stories",
    "workforce",
    "prioritizing",
    "exhaustive",
    "center",
    "participates",
    "flex",
    "communicate",
    "prioritize",
    "parties",
    "requirements",
    "while",
    "development",
    "one",
    "well",
    "units",
    "member",
    "primary",
    "establish",
    "use",
    "degree",
    "general",
    "promised",
    "collaborates",
    "manner",
    "teams",
    "challenge",
    "being",
    "please",
    "write",
    "during",
    "sense",
    "participate",
    "time",
    "aprimo",
    "considered",
    "meantime",
    "kotex",
    "screening",
    "team",
    "exist",
    "sprint",
    "dignity",
    "skills",
    "original",
    "utilizing",
    "especially",
    "built",
    "great",
    "language",
    "exploring",
    "qualifications",
    "correction",
    "monitor",
    "helps",
    "buenos",
    "better",
    "culture",
    "estimate",
    "clearly",
    "behind",
    "billions",
    "b.s",
    "strong",
    "multiple",
    "documentation",
    "flexible",
    "driving",
    "any",
    "winning",
    "estimated",
    "understanding",
    "approachable",
    "cadence",
    "outward",
    "scope",
    "employer",
    "creates",
    "facilitates",
    "fine",
    "mutual",
    "pre",
    "type",
    "roles",
    "follow",
    "adequate",
    "law",
    "owners",
    "technical",
    "provide",
    "putting",
    "communicator",
    "world",
    "plans",
    "location",
    "collaboration",
    "sub",
    "fuel",
    "consideration",
    "amazing",
    "new",
    "maximizes",
    "compliance",
    "budgets",
    "address",
    "drives",
    "adding",
    "number",
    "owned",
    "status",
    "sharp",
    "broad",
    "smartest",
    "problems",
    "understands",
    "solving",
    "click",
    "love",
    "committed",
    "understood",
    "dmv",
    "based",
    "out",
    "balances",
    "above",
    "regions",
    "difference",
    "represents",
    "sectors",
    "specializing",
    "pregnancy",
    "finally",
    "goal",
    "provides",
    "already",
    "entire",
    "owns",
    "expectations",
    "applicants",
    "scott",
    "communicates",
    "caring",
    "web",
    "citizenship",
    "translate",
    "run",
    "settle",
    "fit",
    "orientation",
    "person",
    "responsibilities",
    "responsible",
    "than",
    "careers",
    "ceremonies",
    "drug",
    "supports",
    "employees",
    "tasks",
    "privacy",
    "upon",
    "efficient",
    "maximizing",
    "outstanding",
    "rest",
    "back",
    "millions",
    "complex",
    "organizational",
    "protected",
    "refinement",
    "exercises",
    "similar",
    "equal",
    "regulatory",
    "dialogue",
    "actively",
    "relationship",
    "door",
    "following",
    "people",
    "send",
    "owner",
    "develop",
    "prepared",
    "talented",
    "fixed",
    "volume",
    "join",
    "print",
    "prioritizes",
    "additional",
    "purposeful",
    "applies",
    "ensure",
    "work",
    "needed",
    "standards",
    "overall",
    "bring",
    "arrangements",
    "managing",
    "apply",
    "need",
    "close",
    "information",
    "innovation",
    "related",
    "subject",
    "just",
    "push",
    "employment",
    "ideas",
    "portfolio",
    "prioritization"
  ]
}